<h1>1장 프로그래밍이란?</h1>;
<div>
  <p>프로그래밍 : 컴퓨터에게 실행을 요구하는 일종의 커뮤니케이션</p>
  <p>
    커뮤니케이션을 위해 필요한 것? : 문제 해결 능력, 문제를 명확히 이해하고
    정확하고 상세하게 설명해야 컴퓨터가 알아들을 수 있다
  </p>
  <p>
    컴퓨터와 사람은 인지하는 방식이 다르기에, 애매한 개념은 지양하고 숫자 같은
    양적 개념을 사용해야한다.
  </p>

  <br />

  <p>
    프로그래밍 언어 : 사람이 이해할 수 있는 약속된 구문으로 구성된 언어,
    기계어로 번역하여 컴퓨터에게 보냄
  </p>
  <p>기계어로 번역하는 번역기를 컴파일러라고 한다</p>

  <br />

  <p>영어를 잘하려면 문법을 공부하면 잘해지는가? 아니다. 영어를 잘하려면 말의 뜻이나 문장을 정확히 이해해야 한다.</p> <br />
  const number = "string";
  console.log(number * number) //NaN

  <br />
  <p>문법적으로 전혀 문제가 없지만, 의미가 하나도 없다. 수행하고 자 하는 것을 정확히 실현하는 것이 프로그램의 목적이다.</p>
</div>;
